Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/71e7cac89f081f5c4b6f640ff62064e14eadd247fdf0cce2e586af1b2677cf03.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7182853948221417265" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip" -> "builds/71e7cac89f081f5c4b6f640ff62064e14eadd247fdf0cce2e586af1b2677cf03.zip"
          ~ "timestamp" = "1770000561138565000" -> "1770964409025428000"
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip" -> "builds/e11849b17a3f88637a28601f1425241412e5b6f9e2ce9b69f616888a8e50b20c.zip"
        id                             = "pgxflow-backend-initFlow"
      ~ last_modified                  = "2026-02-02T02:56:04.467+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/initFlow",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e11849b17a3f88637a28601f1425241412e5b6f9e2ce9b69f616888a8e50b20c.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e11849b17a3f88637a28601f1425241412e5b6f9e2ce9b69f616888a8e50b20c.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7355364178958392197" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip" -> "builds/e11849b17a3f88637a28601f1425241412e5b6f9e2ce9b69f616888a8e50b20c.zip"
          ~ "timestamp" = "1770000562450314000" -> "1770964408999346000"
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ image_uri                      = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:212559ac8822cfab6e0711697fbdaaf7c576beb700b99a143e3be583cbc5dab2" -> (known after apply)
      ~ last_modified                  = "2026-02-02T03:09:28.543+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip" -> "builds/bdd44177862294fd86063b4a37813f5846604b145010025787145d048c9209f2.zip"
        id                             = "pgxflow-backend-qcNotes"
      ~ last_modified                  = "2026-02-02T02:52:44.705+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/qcNotes",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bdd44177862294fd86063b4a37813f5846604b145010025787145d048c9209f2.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bdd44177862294fd86063b4a37813f5846604b145010025787145d048c9209f2.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6896569674560006574" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip" -> "builds/bdd44177862294fd86063b4a37813f5846604b145010025787145d048c9209f2.zip"
          ~ "timestamp" = "1770000561046882000" -> "1770964409015592000"
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip" -> "builds/e39e08257ec80312645ac0be1723f9473c9ac9a64339d2f297a553332e2df2fa.zip"
        id                             = "pgxflow-backend-sendJobEmail"
      ~ last_modified                  = "2026-02-02T02:53:03.907+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/lambda/sendJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e39e08257ec80312645ac0be1723f9473c9ac9a64339d2f297a553332e2df2fa.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e39e08257ec80312645ac0be1723f9473c9ac9a64339d2f297a553332e2df2fa.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1208706428406284610" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip" -> "builds/e39e08257ec80312645ac0be1723f9473c9ac9a64339d2f297a553332e2df2fa.zip"
          ~ "timestamp" = "1770000561425004000" -> "1770964408904414000"
        }
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_libraries_layer:1" -> (known after apply)
      ~ code_sha256                 = "WULFiPBCEy8d3Qaj04R12r+d6kc+kv27XsCcdcPmP5s=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-02T02:55:47.878+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_libraries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/4e896b41bdacce4cacb2d23a338eb205c6d7447809c2cea1b21c6a29f8ea7bb0.zip" -> "builds/12b28a54eea4dafeb2798cc758ee660d829962be9a3b3fc4113e2c4a372cd53f.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172631 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20260202024949543200000002/builds/4e896b41bdacce4cacb2d23a338eb205c6d7447809c2cea1b21c6a29f8ea7bb0.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "9fd4f61a6a18c4a4a851dea722e5bb4a" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20260202024949543200000002/builds/4e896b41bdacce4cacb2d23a338eb205c6d7447809c2cea1b21c6a29f8ea7bb0.zip" -> (known after apply)
      ~ key                           = "builds/4e896b41bdacce4cacb2d23a338eb205c6d7447809c2cea1b21c6a29f8ea7bb0.zip" -> "builds/12b28a54eea4dafeb2798cc758ee660d829962be9a3b3fc4113e2c4a372cd53f.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/4e896b41bdacce4cacb2d23a338eb205c6d7447809c2cea1b21c6a29f8ea7bb0.zip" -> "builds/12b28a54eea4dafeb2798cc758ee660d829962be9a3b3fc4113e2c4a372cd53f.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/12b28a54eea4dafeb2798cc758ee660d829962be9a3b3fc4113e2c4a372cd53f.zip"
              + quiet         = "true"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/12b28a54eea4dafeb2798cc758ee660d829962be9a3b3fc4113e2c4a372cd53f.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4446175152787503581" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4e896b41bdacce4cacb2d23a338eb205c6d7447809c2cea1b21c6a29f8ea7bb0.zip" -> "builds/12b28a54eea4dafeb2798cc758ee660d829962be9a3b3fc4113e2c4a372cd53f.zip"
          ~ "timestamp" = "1770000943192851000" -> "1770964410160001000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1" -> (known after apply)
      ~ code_sha256                 = "sxfYxuEzA/OHIFJeJVbwQilT1SspmUJFIp/JsnDisNI=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-02T02:52:00.794+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:997141225542:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/bffc0ec697ff81c8c07ac903e0f8002ed61a20a5d8e8714c8a1bf4d31af10b75.zip" -> "builds/20a38ba407093a97f82f23304a37cfeb3ab676572b723acfc30c89041215f355.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23202 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20260202024949543200000002/builds/bffc0ec697ff81c8c07ac903e0f8002ed61a20a5d8e8714c8a1bf4d31af10b75.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "8f86cdc1ba59e710b26f372baa072e8c" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20260202024949543200000002/builds/bffc0ec697ff81c8c07ac903e0f8002ed61a20a5d8e8714c8a1bf4d31af10b75.zip" -> (known after apply)
      ~ key                           = "builds/bffc0ec697ff81c8c07ac903e0f8002ed61a20a5d8e8714c8a1bf4d31af10b75.zip" -> "builds/20a38ba407093a97f82f23304a37cfeb3ab676572b723acfc30c89041215f355.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/bffc0ec697ff81c8c07ac903e0f8002ed61a20a5d8e8714c8a1bf4d31af10b75.zip" -> "builds/20a38ba407093a97f82f23304a37cfeb3ab676572b723acfc30c89041215f355.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/20a38ba407093a97f82f23304a37cfeb3ab676572b723acfc30c89041215f355.zip"
              + quiet         = "true"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/20a38ba407093a97f82f23304a37cfeb3ab676572b723acfc30c89041215f355.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5557964796383397541" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bffc0ec697ff81c8c07ac903e0f8002ed61a20a5d8e8714c8a1bf4d31af10b75.zip" -> "builds/20a38ba407093a97f82f23304a37cfeb3ab676572b723acfc30c89041215f355.zip"
          ~ "timestamp" = "1770000561047155000" -> "1770964408408965200"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:68893ba66522d962f89a1325542df929bd5757570b4583ca4b59a5a3aa88353c997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:68893ba66522d962f89a1325542df929bd5757570b4583ca4b59a5a3aa88353c" -> (known after apply)
        name         = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:4c12e3920a3ab888eafc51419b539275ad243cd00a53c44c119bb46e8f93acd1" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "ff90866ab8d31d100a8820d5fb186291a5697522" -> "0c7ed487a019d5f7c82468140a729ad1a814c430"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:4c12e3920a3ab888eafc51419b539275ad243cd00a53c44c119bb46e8f93acd1" -> (known after apply)
        name                 = "997141225542.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:4c12e3920a3ab888eafc51419b539275ad243cd00a53c44c119bb46e8f93acd1" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "ff90866ab8d31d100a8820d5fb186291a5697522" -> "0c7ed487a019d5f7c82468140a729ad1a814c430"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/3ed5333e01b7e9ddff406ac3125eddf0f13aca44826abd50aea8e51b16158783.zip" -> "builds/aae553ad755ff16586deca3194e35a3cc5a0ff03f11e505ab7e96f8a5fc37782.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2026-02-02T03:07:53.816+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/aae553ad755ff16586deca3194e35a3cc5a0ff03f11e505ab7e96f8a5fc37782.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/aae553ad755ff16586deca3194e35a3cc5a0ff03f11e505ab7e96f8a5fc37782.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "494368741615656535" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3ed5333e01b7e9ddff406ac3125eddf0f13aca44826abd50aea8e51b16158783.zip" -> "builds/aae553ad755ff16586deca3194e35a3cc5a0ff03f11e505ab7e96f8a5fc37782.zip"
          ~ "timestamp" = "1770000561724515000" -> "1770964395605611000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/021217a261d570eaa8f75465f8ad1502c61f219a094061b6e20bb551a02ab778.zip" -> "builds/4f15f92f4a7ec291d2a1402e9be367586c275fe59ce81afc3146c0a7fab1e53c.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2026-02-02T03:09:06.155+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/4f15f92f4a7ec291d2a1402e9be367586c275fe59ce81afc3146c0a7fab1e53c.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4f15f92f4a7ec291d2a1402e9be367586c275fe59ce81afc3146c0a7fab1e53c.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2980975895686170936" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/021217a261d570eaa8f75465f8ad1502c61f219a094061b6e20bb551a02ab778.zip" -> "builds/4f15f92f4a7ec291d2a1402e9be367586c275fe59ce81afc3146c0a7fab1e53c.zip"
          ~ "timestamp" = "1770000561950993000" -> "1770964396110259000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/da0b156e7ec9acbe69f6b0b64b9c3b3c1c16e33e56ef46179bc54928d9131d18.zip" -> "builds/705877a44dd72a8a8aa91217b91bd8e62d0cc9b9e22743c98fe894c9c0d08734.zip"
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2026-02-02T03:08:16.611+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/deidentifyFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/705877a44dd72a8a8aa91217b91bd8e62d0cc9b9e22743c98fe894c9c0d08734.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/705877a44dd72a8a8aa91217b91bd8e62d0cc9b9e22743c98fe894c9c0d08734.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8449997326322798293" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/da0b156e7ec9acbe69f6b0b64b9c3b3c1c16e33e56ef46179bc54928d9131d18.zip" -> "builds/705877a44dd72a8a8aa91217b91bd8e62d0cc9b9e22743c98fe894c9c0d08734.zip"
          ~ "timestamp" = "1770000561949502000" -> "1770964396412525800"
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip" -> "builds/386e5bf7fe4e26d7a89b3de89607ad1d2e091e9af0ea94bb192a516094aa9d99.zip"
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ last_modified                  = "2026-02-02T03:08:34.889+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateCohortVCfs/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateCohortVCfs",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/386e5bf7fe4e26d7a89b3de89607ad1d2e091e9af0ea94bb192a516094aa9d99.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/386e5bf7fe4e26d7a89b3de89607ad1d2e091e9af0ea94bb192a516094aa9d99.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6042788958745955057" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip" -> "builds/386e5bf7fe4e26d7a89b3de89607ad1d2e091e9af0ea94bb192a516094aa9d99.zip"
          ~ "timestamp" = "1770000561606550000" -> "1770964396706732000"
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip" -> "builds/71e5abe7ac69e07c71ae41d43cc29839c468fd25e67c3fe8ae562d6155e63556.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2026-02-02T02:52:05.457+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/71e5abe7ac69e07c71ae41d43cc29839c468fd25e67c3fe8ae562d6155e63556.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/71e5abe7ac69e07c71ae41d43cc29839c468fd25e67c3fe8ae562d6155e63556.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7010722351838610704" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/79ec83576adc5e229d092065b89618f80438e1526ae579f93119cfdc582087ae.zip" -> "builds/71e5abe7ac69e07c71ae41d43cc29839c468fd25e67c3fe8ae562d6155e63556.zip"
          ~ "timestamp" = "1770000560613334000" -> "1770964396447364000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip" -> "builds/3f8f2fe99ae2f255004c399a8bb90c88d28de808514b3a7abb250d67f20a85e4.zip"
        id                             = "sbeacon-backend-getAnalyses"
      ~ last_modified                  = "2026-02-02T03:09:40.693+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getAnalyses",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3f8f2fe99ae2f255004c399a8bb90c88d28de808514b3a7abb250d67f20a85e4.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3f8f2fe99ae2f255004c399a8bb90c88d28de808514b3a7abb250d67f20a85e4.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7402270526987534900" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip" -> "builds/3f8f2fe99ae2f255004c399a8bb90c88d28de808514b3a7abb250d67f20a85e4.zip"
          ~ "timestamp" = "1770000561726834000" -> "1770964396508135000"
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip" -> "builds/0fda9accfa015a4f546db1033b3794a29b64491fe6f835980608d963dd9f6b74.zip"
        id                             = "sbeacon-backend-getBiosamples"
      ~ last_modified                  = "2026-02-02T03:09:12.423+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getBiosamples",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0fda9accfa015a4f546db1033b3794a29b64491fe6f835980608d963dd9f6b74.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0fda9accfa015a4f546db1033b3794a29b64491fe6f835980608d963dd9f6b74.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6115184970142885161" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip" -> "builds/0fda9accfa015a4f546db1033b3794a29b64491fe6f835980608d963dd9f6b74.zip"
          ~ "timestamp" = "1770000561139314000" -> "1770964395736548000"
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip" -> "builds/1a339235cd0bf2accfc9efa106a40925ede7778b6c13c85806b84faa8a557b86.zip"
        id                             = "sbeacon-backend-getConfiguration"
      ~ last_modified                  = "2026-02-02T03:08:27.874+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getConfiguration",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1a339235cd0bf2accfc9efa106a40925ede7778b6c13c85806b84faa8a557b86.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1a339235cd0bf2accfc9efa106a40925ede7778b6c13c85806b84faa8a557b86.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7292802424241988060" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip" -> "builds/1a339235cd0bf2accfc9efa106a40925ede7778b6c13c85806b84faa8a557b86.zip"
          ~ "timestamp" = "1770000562061662000" -> "1770964396037477000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e07d951d661b60e158870dc03784c11675431fea90809ca3a34a70333df8e5a8.zip" -> "builds/bed3ce17509de016bb3a14a87f46f082cd1114523c9a15b4a82dee789f1db651.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2026-02-02T03:09:23.728+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bed3ce17509de016bb3a14a87f46f082cd1114523c9a15b4a82dee789f1db651.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bed3ce17509de016bb3a14a87f46f082cd1114523c9a15b4a82dee789f1db651.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7717755741351670474" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e07d951d661b60e158870dc03784c11675431fea90809ca3a34a70333df8e5a8.zip" -> "builds/bed3ce17509de016bb3a14a87f46f082cd1114523c9a15b4a82dee789f1db651.zip"
          ~ "timestamp" = "1770000562619184000" -> "1770964395515477000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip" -> "builds/f71fa97015d840259b6bd671ba13e7a3a86381459c3b7a35d86424294f59ab59.zip"
        id                             = "sbeacon-backend-getEntryTypes"
      ~ last_modified                  = "2026-02-02T03:08:10.956+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getEntryTypes",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f71fa97015d840259b6bd671ba13e7a3a86381459c3b7a35d86424294f59ab59.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f71fa97015d840259b6bd671ba13e7a3a86381459c3b7a35d86424294f59ab59.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2573625400793772768" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip" -> "builds/f71fa97015d840259b6bd671ba13e7a3a86381459c3b7a35d86424294f59ab59.zip"
          ~ "timestamp" = "1770000562802548800" -> "1770964396617799000"
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip" -> "builds/7c148de715f51d1cf90f83a4bc0a2882a80c01c650f5d1f7b4f0cfd6d1a19f20.zip"
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ last_modified                  = "2026-02-02T03:07:59.568+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getFilteringTerms",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7c148de715f51d1cf90f83a4bc0a2882a80c01c650f5d1f7b4f0cfd6d1a19f20.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7c148de715f51d1cf90f83a4bc0a2882a80c01c650f5d1f7b4f0cfd6d1a19f20.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5728976456673458766" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip" -> "builds/7c148de715f51d1cf90f83a4bc0a2882a80c01c650f5d1f7b4f0cfd6d1a19f20.zip"
          ~ "timestamp" = "1770000560417837000" -> "1770964395947763000"
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip" -> "builds/5d884872e519fb9deed25aa082daa55a3ea5e87bb1f9c096997191204a597ff6.zip"
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ last_modified                  = "2026-02-02T03:09:29.413+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getGenomicVariants",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5d884872e519fb9deed25aa082daa55a3ea5e87bb1f9c096997191204a597ff6.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5d884872e519fb9deed25aa082daa55a3ea5e87bb1f9c096997191204a597ff6.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6666607333214682230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip" -> "builds/5d884872e519fb9deed25aa082daa55a3ea5e87bb1f9c096997191204a597ff6.zip"
          ~ "timestamp" = "1770000562833160000" -> "1770964395724294000"
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip" -> "builds/0b0909119a75f632d9d54d32b9e495353e741e9da0ac98eaa5ed4eba18154c81.zip"
        id                             = "sbeacon-backend-getIndividuals"
      ~ last_modified                  = "2026-02-02T03:09:18.095+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getIndividuals",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0b0909119a75f632d9d54d32b9e495353e741e9da0ac98eaa5ed4eba18154c81.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0b0909119a75f632d9d54d32b9e495353e741e9da0ac98eaa5ed4eba18154c81.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4478641732099797223" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip" -> "builds/0b0909119a75f632d9d54d32b9e495353e741e9da0ac98eaa5ed4eba18154c81.zip"
          ~ "timestamp" = "1770000561506535000" -> "1770964395451292000"
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip" -> "builds/03203d09a386ea5cbd0f9ed1fd3041c40c9dc49c80a2e765c08f18139cb4185a.zip"
        id                             = "sbeacon-backend-getInfo"
      ~ last_modified                  = "2026-02-02T03:08:40.986+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getInfo",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/03203d09a386ea5cbd0f9ed1fd3041c40c9dc49c80a2e765c08f18139cb4185a.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/03203d09a386ea5cbd0f9ed1fd3041c40c9dc49c80a2e765c08f18139cb4185a.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7751794803764930744" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip" -> "builds/03203d09a386ea5cbd0f9ed1fd3041c40c9dc49c80a2e765c08f18139cb4185a.zip"
          ~ "timestamp" = "1770000560523897000" -> "1770964396032361000"
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip" -> "builds/8ed5d67152d9983373eadf243e87eaf4f24e30383e7065d77308225376c5e9c6.zip"
        id                             = "sbeacon-backend-getMap"
      ~ last_modified                  = "2026-02-02T03:08:46.674+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:997141225542:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Envi
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.